# **Data Science Learners Hub**

**Module : SQL**

**Topic :** **Understanding NULL**

**email** : [datasciencelearnershub@gmail.com](mailto:datasciencelearnershub@gmail.com)

In [1]:
USE DataScienceLearnersHub

In [1]:
SELECT * FROM Emp

id,name,age,gender,salary,department
1,Rajesh,30,Male,60000.00,IT
2,Padma,25,Female,55000.50,HR
3,Laxman,35,Male,70000.75,Finance
4,Ganga,28,Female,48000.25,Marketing
5,Nikhil,32,Male,72000.00,IT
6,Sarita,29,Female,58000.75,HR
7,Bunny,40,Male,85000.50,Finance
8,Namrata,26,Female,50000.50,Marketing
9,Abhiram,38,Male,78000.25,IT
10,Tikram,31,Female,62000.00,Finance
11,Ramulu,58,Male,178000.25,IT
12,Bala,51,Female,162000.00,Finance

In [3]:
INSERT INTO Emp (id, name, gender)
VALUES 
    (13, 'Ananya', 'Female'),
    (14, 'Sai', 'Male'),
    (15, 'Varsha', 'Female')

-- NOTE : Since the values are not inserted in all the columns of the table so age, salary and department columns will have NULL values

In [4]:
SELECT * FROM Emp

id,name,age,gender,salary,department
1,Rajesh,30,Male,60000.00,IT
2,Padma,25,Female,55000.50,HR
3,Laxman,35,Male,70000.75,Finance
4,Ganga,28,Female,48000.25,Marketing
5,Nikhil,32,Male,72000.00,IT
6,Sarita,29,Female,58000.75,HR
7,Bunny,40,Male,85000.50,Finance
8,Namrata,26,Female,50000.50,Marketing
9,Abhiram,38,Male,78000.25,IT
10,Tikram,31,Female,62000.00,Finance
11,Ramulu,58,Male,178000.25,IT
12,Bala,51,Female,162000.00,Finance
13,Ananya,NULL,Female,NULL,NULL
14,Sai,NULL,Male,NULL,NULL
15,Varsha,NULL,Female,NULL,NULL

**What are NULL Values in MS SQL Server ?**

**Definition:**
- **NULL** represents <mark>**`missing or unknown data`**</mark> in a database.

**Key Points:**
- **Not Zero or Empty**: <mark>**`NULL is different from zero, an empty string`**</mark>, or any other default value.
- **Data Type Compatibility**: <mark>`Can appear in any data type (e.g., integers, strings, dates).`</mark>
- **Handling**: Special functions like `IS NULL`, `IS NOT NULL`, and `COALESCE` are used to manage NULL values.

**Usage Example:**
```sql
-- Check for NULL values in a column
SELECT * FROM Employees
WHERE manager_id IS NULL;
```

**Important Notes:**
- **Comparisons**: <mark>NULL values cannot be compared using standard operators (e.g., =, <, >)</mark>.
- **Aggregations**: <mark>Functions like `SUM`, `AVG`, ignore NULL values in calculations.</mark>

**Example :**

- Here, the \`IS NULL\` condition retrieves rows where the "salary" column has a \`NULL\` value, indicating employees without a salary.

In [2]:
SELECT id, name, age, salary
FROM Emp
WHERE salary IS NULL;

id,name,age,salary
13,Ananya,NULL,NULL
14,Sai,NULL,NULL
15,Varsha,NULL,NULL

### **Peculiarities of NULL:**

### **1. Can NULL be Compared with Another NULL?**

**Explanation:**
- **Equality Comparison**: <mark>NULL cannot be compared to another NULL using standard equality operators (`=`, `!=`).</mark>
- **Reason**: NULL represents unknown or missing data, so two NULL values are not considered equal<mark> because the actual values are unknown.</mark>

**Key Points:**
- **Standard Comparison Fails**:
  ```sql
  SELECT * FROM Employees WHERE manager_id = NULL;  -- This does not work
  ```
- **Use IS NULL**:
  ```sql
  -- Correct way to check for NULL
  SELECT * FROM Employees WHERE manager_id IS NULL;
  ```
- **Use IS NOT NULL**:
  ```sql
  -- Correct way to check for non-NULL
  SELECT * FROM Employees WHERE manager_id IS NOT NULL;
  ```

**Important Note:**
- **Three-Valued Logic**: <mark>SQL uses three-valued logic (true, false, unknown) where comparisons with NULL result in unknown.</mark>

#### Example

In [6]:
SELECT id, name
FROM Emp
WHERE age IS NULL;

id,name
13,Ananya
14,Sai
15,Varsha

### **2\. Aggregations and NULL:**

- Aggregate functions generally ignore \`NULL\` values. Use functions like \`COALESCE\` or \`ISNULL\` to handle \`NULL\` values during aggregations.

In [7]:
SELECT AVG(ISNULL(salary, 0))
FROM Emp;

(No column name)
65200.250000

### **3\. Sorting with NULL in Emp Table:**

- When sorting results that include NULL values, be aware that NULLs may be placed at the beginning or end of the result set depending on the sorting order (\`ORDER BY\` clause).

In [2]:
SELECT *
FROM Emp
ORDER BY id DESC; -- DESC places NULLs at the beginning

id,name,age,gender,salary,department
15,Varsha,NULL,Female,NULL,NULL
14,Sai,NULL,Male,NULL,NULL
13,Ananya,NULL,Female,NULL,NULL
12,Bala,51,Female,162000.00,Finance
11,Ramulu,58,Male,178000.25,IT
10,Tikram,31,Female,62000.00,Finance
9,Abhiram,38,Male,78000.25,IT
8,Namrata,26,Female,50000.50,Marketing
7,Bunny,40,Male,85000.50,Finance
6,Sarita,29,Female,58000.75,HR
5,Nikhil,32,Male,72000.00,IT
4,Ganga,28,Female,48000.25,Marketing
3,Laxman,35,Male,70000.75,Finance
2,Padma,25,Female,55000.50,HR
1,Rajesh,30,Male,60000.00,IT

### **4\. Concatenation with NULL in Emp Table:**

- Concatenating a NULL value with a string using the \`+\` operator results in a NULL value. Use the \`CONCAT\` function or \`ISNULL\` to handle concatenation with NULL.

In [3]:
SELECT ISNULL(name, '') + ' ' + ISNULL(department, 'NoDepartment') AS Full_Name
FROM Emp;

Full_Name
Rajesh IT
Padma HR
Laxman Finance
Ganga Marketing
Nikhil IT
Sarita HR
Bunny Finance
Namrata Marketing
Abhiram IT
Tikram Finance
Ramulu IT
Bala Finance
Ananya NoDepartment
Sai NoDepartment
Varsha NoDepartment

In [4]:
-- Concatenation with NULL using the + operator
SELECT id, name + ' ' + department AS Full_Name
FROM Emp;

id,Full_Name
1,Rajesh IT
2,Padma HR
3,Laxman Finance
4,Ganga Marketing
5,Nikhil IT
6,Sarita HR
7,Bunny Finance
8,Namrata Marketing
9,Abhiram IT
10,Tikram Finance
11,Ramulu IT
12,Bala Finance
13,NULL
14,NULL
15,NULL

### **5. Handling Concatenation with NULL using CONCAT:**

In [3]:
SELECT TOP 10 id, CONCAT(ISNULL(name, ''), ' ', ISNULL(department, 'NoDepartment')) AS Full_Name
FROM Emp
ORDER BY id DESC;

id,Full_Name
15,Varsha NoDepartment
14,Sai NoDepartment
13,Ananya NoDepartment
12,Bala Finance
11,Ramulu IT
10,Tikram Finance
9,Abhiram IT
8,Namrata Marketing
7,Bunny Finance
6,Sarita HR

#### Explanation
- **CONCAT Function**: Combines `name` and `department` columns.
- **ISNULL Function**: Replaces NULL values with an empty string for `name` and 'NoDepartment' for `department`.
- **Automatic Handling**: CONCAT handles NULL values, ensuring the result is not NULL.

### **5\. Handling NULL in CASE Statements in Emp Table:**

- When using \`CASE\` statements, be aware that NULL values may require explicit handling to avoid unexpected results.

In [8]:
SELECT *,
    CASE
        WHEN salary IS NULL THEN 'No Salary'
        ELSE CAST(salary AS VARCHAR(10))
    END AS Salary_Info
FROM Emp;

id,name,age,gender,salary,department,Salary_Info
1,Rajesh,30,Male,60000.00,IT,60000.00
2,Padma,25,Female,55000.50,HR,55000.50
3,Laxman,35,Male,70000.75,Finance,70000.75
4,Ganga,28,Female,48000.25,Marketing,48000.25
5,Nikhil,32,Male,72000.00,IT,72000.00
6,Sarita,29,Female,58000.75,HR,58000.75
7,Bunny,40,Male,85000.50,Finance,85000.50
8,Namrata,26,Female,50000.50,Marketing,50000.50
9,Abhiram,38,Male,78000.25,IT,78000.25
10,Tikram,31,Female,62000.00,Finance,62000.00
11,Ramulu,58,Male,178000.25,IT,178000.25
12,Bala,51,Female,162000.00,Finance,162000.00
13,Ananya,NULL,Female,NULL,NULL,No Salary
14,Sai,NULL,Male,NULL,NULL,No Salary
15,Varsha,NULL,Female,NULL,NULL,No Salary

### **6.** <span style="font-size: 16.38px;"><b>What is important to consider about NULL values in database indexes?</b></span>

- Some database systems may treat \`NULL\` values differently in indexes. Understand the behavior of \`NULL\` values in the specific database system being used.

**Note :** 

- Understanding \`NULL\` and its handling is crucial in database design and query writing to avoid unexpected results and ensure accurate data representation, particularly with the "Emp" table or any other real-world data scenario.

### **6. What is important to consider about `NULL` values in database indexes?**

- **Behavior in Indexes**: <mark>`NULL` values may be handled differently by various database systems in index structures.</mark>
- **Crucial Understanding**:<mark> Understanding how `NULL` values are managed is essential for database design and querying.</mark>
- **Avoiding Issues**: <mark>Helps prevent unexpected results</mark> and ensures accurate data representation, especially when working with tables like "Emp" or real-world datasets.

### **Statement 1 : Is the statement "Any arithmetic operation performed with NULL will always result in NULL" true or false? Explain.**

#### `True`.

**Explanation:**
- **Three-Valued Logic**: SQL uses three-valued logic (true, false, unknown).
- **Result**: Any operation involving NULL results in NULL because NULL represents an unknown value.

In [9]:
SELECT NULL + 5; -- Result: NULL

(No column name)
NULL

### **Statement 2: NULL and Zero are different.**

  

- **True**. NULL represents the absence of a value or an unknown value, whereas zero is a specific numeric value. They have different meanings.

### **Statement 2 : NULL and Zero are Different. Is the statement True or False**

#### `TRUE`

**NULL and Zero are Different:**

- **NULL**: Represents the absence or unknown value.
- **Zero**: A specific numeric value.
- **Different Meanings**: They are not interchangeable.

**Example:**
```sql
SELECT id, name, salary
FROM Employees
WHERE salary IS NULL;  -- Finds employees with unknown salary

SELECT id, name, salary
FROM Employees
WHERE salary = 0;  -- Finds employees with a salary of zero
```

In [10]:
SELECT NULL AS NullValue, 0 AS ZeroValue;

-- The result will show a NULL value for `NullValue` and 0 for `ZeroValue`.

NullValue,ZeroValue
NULL,0

### **Statement 3: Zero is a value. NULL is blank.**

#### `FALSE`

**Explanation:**
- **Zero**: Is indeed a specific numeric value, typically used to denote the numerical quantity of zero.
- **NULL**: Represents the absence of a value or an unknown value. It is not "blank" in the sense of being an empty string or empty space. NULL is a distinct concept from zero and any other value.

In SQL:
- Zero (`0`) is a concrete numeric value.
- NULL <mark>**(`NULL`) is a placeholder indicating missing or unknown data**</mark>, <mark>**`and it is not comparable to any specific value, including zero and is also distinct from empty string and spaces`**</mark>.

Therefore, the statement "Zero is a value. NULL is blank" is not true in SQL. It's important to understand the distinction between these concepts to use SQL effectively and accurately in database queries and operations.

In [11]:
SELECT '' AS EmptyString, NULL AS NullValue;

-- The result will show an empty string for `EmptyString` and a NULL value for `NullValue`.

EmptyString,NullValue
,NULL

**Note :**

- Understanding these distinctions is crucial when working with SQL databases to avoid unexpected results and ensure accurate data representation.